
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВКМ_ЗаполнитьГрафик(Команда)
	ВКМ_ЗаполнитьГрафикНаСервере();
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Обработка завершена!";
	Сообщение.Сообщить();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВКМ_ЗаполнитьГрафикНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВКМ_ЗаполнитьГрафик(ВКМ_Период.ДатаНачала, ВКМ_Период.ДатаОкончания, ВКМ_Выходные, ВКМ_ГрафикРаботы);
КонецПроцедуры
#КонецОбласти




